Revit 2027 API
ReferenceArray.Item Property
Gets or sets a reference at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Reference this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Reference
	Get
	Set
public:
virtual property Reference^ Item[int index] {
	Reference^ get (int index);
	void set (int index, Reference^ value);
}
abstract Item : Reference with get, set
override Item : Reference with get, set
Parameters
index Int32
The index of the reference to be set or retrieved.
Return Value
Reference
Returns the reference at the specified index.
See Also
Reference
ReferenceArray Class
Autodesk.Revit.DB Namespace